In [1]:
import numpy as np
import pandas as pd
import xlrd

In [5]:
data = pd.read_excel('Frequency of Purchase Analysis Data Question.xlsx',engine = 'openpyxl')

In [6]:
data

,Outlet ID,Brand Name,Sales Value,DATE,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,Outlet 1,Brand 1,395.6906,2018-04-10,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Outlet 1,Brand 1,395.6906,2018-04-24,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Outlet 1,Brand 2,724.9328,2018-04-10,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Outlet 1,Brand 3,150.0466,2018-04-10,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Outlet 1,Brand 3,300.0932,2018-04-24,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
25468,Outlet 23559,Brand 3,150.0466,2018-04-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25469,Outlet 23560,Brand 1,395.6906,2018-04-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25470,Outlet 23560,Brand 3,300.0932,2018-04-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25471,Outlet 23561,Brand 1,395.6906,2018-04-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25472,Outlet 23561,Brand 3,150.0466,2018-04-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
data.shape

(25473, 11)